import random

#1
class Tarrot_Cards(object):
    def __init__(self,value):
        self.value = value
#3
    def __unicode__(self):
        return self.show()
    def __str__(self):
        return "{:40}".format(self.show())
    def __repr__(self):
        return self.show()
#2
    def show(self):
        if self.value == 1:
            val = " 'The Fool' : จะมีการการเริ่มต้นกิจการใหม่ๆ,ภาวะทางการเงินจะไม่แน่นอนคาดหวังความสม่ำเสมอไม่ได้,ระวังเกี่ยวกับระบบความดันโลหิต"
        elif self.value == 2:
            val = " 'The Magician' : การเริ่มต้นใหม่สามารถทำสิ่งที่หวังให้สำเร็จลงได้,จะมีสภาพการเงินที่ดีขึ้น,คนรักใหม่และคนรักเก่าจะมาในช่วงที่คุณไม่อยากมีความรักเท่าใดนัก หากแอบชอบใครอยู่อาจไม่สมหวัง ,ระวังระบบทางเดินหายใจและระบบปลายประสาทอักเสบ"
        elif self.value == 3:
            val = " 'The High Priestress' : ธุรกิจจะดำเนินไปอย่างเชื่องช้าในระยะแรก , คุณจะต้องใช้ความอดทน การเงินจะมาแบบช้าๆ , ในชายอาจพบหญิงคนหนึ่งที่มีเสน่ห์น่าลุ่มหลง ในหญิงอาจจะเป็นรักข้างเดียวหรือรักซ้อนก็ได้ ,ระมัดระวังระบบการย่อยอาหาร ไต หรือระบบปัสสาวะ"
        elif self.value == 4:
            val = " 'The Empress' : เป็นไพ่ของความสมหวัง อาจลงท้ายด้วยการแต่งงาน หรือหมายถึง การมีเพศสัมพันธ์ที่เกิดจากความรัก การตั้งครรภ์ , ถ้าจะค้าขายก็เหมาะของสวยๆงามๆหรือไม่ก็พวกอิเล็กโทรนิคไปเลย ส่วนงานยังไม่เสร็จตามกำหนดต้องแก้ไขปรับปรุง , ระวังเกี่ยวกับระบบการสืบพันธุ์ เช่น มดลูก"
        elif self.value == 5:
            val = " 'The Emperor' : ควรระมัดระวังการใช้จ่ายอย่างฟุ่มเฟือยหน้าใหญ่ใจกว้าง , พบเนื้อคู่ ผู้หญิงพบรักกับชายอายุมากกว่าหรือเป็นคนต่างชาติ , ทางสุขภาพระวังศีรษะ มักจะมีอาการปวดหัวได้ง่าย"
        elif self.value == 6:
            val = " 'The Hierophant' : คุณอาจจะมีปัญหาจุกจิกๆ ในงาน หรือมีคนจุกจิกใส่คุณ , คุณจะวางแผนการเงินใหม่แต่อย่าเคร่งครัดมากนะ , หากผู้หญิงเปิดได้ไพ่ใบนี้หมายถึง ได้แต่งงานช้าหรือคู่อายุแก่กว่ามาก ,  ให้ระมัดระวังระบบการย่อย ท้องอืด ท้องเฟ้อ"
        elif self.value == 7:
            val = " 'The Lover' : อาจจะได้เปลี่ยนงานใหม่ ได้หุ้นส่วนที่ดีหรือคุณจะมีทางสายใหม่ที่ดีกว่าเดิม , การเงินสามารถหามาได้เรื่อยๆ แบบสบายๆ , หากเป็นคนโสด ก็จะพบรักในเวลาไม่นานนัก ,ระวังพวกลมในกระเพาะอาหาร การจุกเสียด"
        elif self.value == 8:
            val = " 'The Chariot' : คนโสด คุณอาจพบรักกับคนแปลกหน้า คนที่มีคนรักแล้วอาจจะมีปัญหาจำเป็นต้องแยกกันสักพักและกลับมาคืนดีกัน , เผชิญปัญหาการเงิน , สุขภาพ มักเกี่ยวกับระบบการย่อยการขับถ่ายไม่ดี"
        elif self.value == 9:
            val = " 'The Strength' : คุณอาจจะได้รับรางวัลแห่งความสำเร็จในความเพียร , เงินที่คาดหวังไว้จะได้มา , หากคุณเพิ่งพบใครบางคน เวลาจะเป็นตัวช่วยให้ความรักของคุณมั่นคงขึ้น ในรายที่ไม่มีแฟน คุณยังไม่พร้อมที่จะรักใครเนื่องจากยังอาวรณ์กับความหลัง , สุขภาพ แข็งแรงมาก"
        elif self.value == 10:
            val = " 'The Hermit' : งานที่ทำเหมาะกับโครงการระยะยาว หากถามถึงงานที่ทำอยู่ , เงินที่เข้ามาเป็นระลอก มีมากพอที่จะจ่ายลงไป , เป็นช่วงเวลาที่อยู่ตามลำพัง รู้สึกเหงา ไม่มีใคร คนรักเก่าอาจกลับเข้ามาสู่ชีวิตคุณอีกครั้งหนึ่ง , อาการเหมือนโรคซึมเศร้า"
        elif self.value == 11:
            val = " 'The Wheel of Fortune' : หากมีความสัมพันธ์อยู่แล้ว สบายๆไม่หึงหวงซึ่งกันและกัน และอาจจะมีคนรักเก่ากลับเข้ามาในชีวิตอีกครั้งหนึ่ง ในคนโสดมีแนวโน้มว่าจะได้พบใครสักคนท่ามกลางคนหมู่มาก, ระวังโรคในช่องท้อง พวกกระเพาะอาหาร ตับ ไต , มีมรดกทรัพย์สมบัติ หรือมีโชคจากการซื้อที่ดิน"
        elif self.value == 12:
            val = " 'Justice' : ในการทำงานจะได้รับความยุติธรรมจากคนรอบข้าง , สถานะการเงินเป็นแบบมาเร็วไปเร็ว , จากประสบการณ์แล้วหากมีเพศตรงข้ามเข้ามาติดพันและหลงคุณมากๆ ต้องระวังให้มากเค้าจะแค่หลงอยู่พักหนึ่งแล้วก็จะจากไป , ส่วนใหญ่จะไม่ค่อยเจ็บป่วย"
        elif self.value == 13:
            val = " 'The Hanged Man' : เป็นช่วงที่ต้องมีความอดทนกับสภาวะการงานที่ทำอยู่ ธุรกิจที่ทำอยู่ เริ่มส่อเค้าปัญหา , จะมีปัญหาด้านการเงิน มีคนจะมาเอาเปรียบด้านการเงิน , คนโสดมีความโหยหาในเรื่องความรัก มีความอ่อนไหว หากเพิ่งเริ่มคบกัน อย่างเพิ่งเทใจ, สุขภาพ ให้ระวังโรคเบาหวาน ผู้หญิงระวังเกี่ยวกับ มดลูกด้วย"
        elif self.value == 14:
            val = " 'Death' : การงานอาจมีความล้มเหลว ผิดหวัง หุ้นส่วนแตกคอกัน , รายได้ค่อนข้างแย่มาก รายได้ตกลงอย่างเห็นได้ชัด ต้องระวัง เงินหาย ถูกยกเค้า โดนล้วงกระเป๋า , หากมีคนรักจะมีปัญหา จนอาจเลิกกันได้ ในคนโสด จะพบกับคนที่น่าหลงใหลอย่างมาก , สุขภาพ อาจเจ็บป่วยกระทันหัน ป่วยหนักต้องเข้าโรงพยาบาล"
        elif self.value == 15:
            val = " 'Temperance' : มีโอกาสย้ายงาน หรือออกจากงานค่อนข้างสูง มีการเดินทางไปพบปะผู้คน เพื่อเจรจาตกลงทางธุรกิจ , มีการหมุนเงินเยอะมากในช่วงนี้ , หากกำลังมีปัญหากับคนรักอาจต้องการเลิกรา ที่เลิกราก็จะกลับมารักกัน คนโสดจะมีเพื่อนแนะนำใครบางคนมาให้ , สุขภาพ การทำงานโดยไม่หยุดพัก ทำให้ร่างกายอ่อนแอ"
        elif self.value == 16:
            val = " 'The Devil' : การทำงานหนักมาก หากทำธุรกิจของตนเอง จะได้กำไรน้อยมาก ไม่สมกับที่ลงแรงทำลงไป , ความรัก จะมีแรงดึงดูดระหว่างกันและกันอย่างมิอาจต้านทานได้ ภายหลังจากความปรารถนาอันแรงกล้าผ่านไปแล้ว อาจพบว่าไม่มีอะไรเหมือนกันเลยทำให้ต้องเลิกกันไป , สุขภาพ มีโอกาสเป็นเกี่ยวกับโรคทางเพศสัมพันธ์"
        elif self.value == 17:
            val = " 'The Tower' : สิ่งที่คิดว่ากำลังไปได้ด้วยดีกลับพังทลายลงอย่างไม่คาดคิด ปัญหามักจะเกิดกะทันหันโดยไม่ทันตั้งตัว , จะเกิดการสูญเสียเงิน หรือเสียเงินก้อนโตนับตั้งแต่ที่เคยเสียมา,ความรัก อาจจะอกหัก หรือมีการหย่าร้างเกิดขึ้น , สุขภาพ ระวังการเจ็บป่วยแบบกระทันหันหรืออุบัติเหตุ"
        elif self.value == 18:
            val = " 'The Star' : การงาน หมายถึง ต้องการปรับปรุงให้ดีขึ้นต่อไป , คาดการณ์สิ่งใดเกี่ยวกับการเงินไว้มักจะได้ตามที่คาด , มักเป็นโสด โดยใช้เวลาส่วนใหญ่กับเพื่อนฝูง , สุขภาพ มักเป็นการฟื้นตัวจากความเจ็บป่วย"
        elif self.value == 19:
            val = " 'The Moon' : การงาน หมายถึง อย่าวู่วาม ต้องควบคุมอารมณ์อย่างมาก อาจมีคนกลั่นแกล้งในงานระมัดระวังปัญหาเกี่ยวกับเอกสารต่างๆ ให้ดี, ต้องระมัดระวังอาจถูกโกงเงินหุ้นส่วนเอาเปรียบ ระมัดระวังด้านเอกสารให้ดี , หากมีคนรักแล้ว อาจถูกคนรักหลอกลวงอยู่ หากเป็นคนโสด กำลังโหยหาความรักอย่างมาก , ระวังระบบเลือด น้ำเหลือง และมดลูกไม่ดี"
        elif self.value == 20:
            val = " 'The Sun' : จะได้งานใหม่หากตกงานอยู่ ธุรกิจส่วนตัวจะคล่องตัวขึ้นการติดต่อการงานกับผู้ใหญ่ , การเงิน หากรอข่าวใดอยู่ จะได้รับข่าวดี , จะได้คู่ที่ดี ช่วยส่งเสริมกันและกันให้เจริญรุ่งเรือง หากยังไม่มีคนรักก็จะมีเข้ามา ทำนองว่าช้าแต่ชัวร์ , สุขภาพ โดยส่วนมากแข็งแรง"
        elif self.value == 21:
            val = " 'Judgement' : หากเพิ่งลาออกจากงานก็จะได้งานใหม่ในเวลาไม่นานนัก , เรื่องการเงิน หากลงทุนอะไรลงไปก็จะได้รับผลตอบแทนค่อนข้างดี , ความรัก เป็นเรื่องที่ต้องตัดสินใจ เนื่องจากคนรักเก่าได้หวนกลับมา"
        elif self.value == 22:
            val = " 'The world' : งานที่ทำมานานจะประสบความสำเร็จตามที่หวังโดยเฉพาะในสายงานศิลปะงานพวกนายหน้าขายที่ดิน, เงินทองไหลมาเทมา ,สุขภาพแข็งแรง , ความรัก หากเปิดไพ่ Empress และ The Sun มาประกบคู่กันหมายถึงการมีบุตร"
        else:
            val = self.value

        return "{}".format(val)
#4
# a = Tarrot_Cards(1)
# print (a.show)

#5
class Deck(object):
    def __init__(self):
        self.cards = []
        self.build()
    
    def build(self):
        self.cards =[]
        for val in range(1,23): #ไม่งั้นไพ่ใบที่สองไม่แสดง
            self.cards.append(Tarrot_Cards(val))
    
    def show(self):
        for card in self.cards:
            print (card.show())
    
    def shuffle(self, num=1):
        length = len(self.cards)
        for _ in range (num):
            for i in range( length -1,0,-1):
                randi = random.randint(0,i) #import random
                if i == randi:
                        continue
                self.cards[i] , self.cards[randi] = self.cards[randi] , self.cards[i]

    def deal(self):
        return self.cards.pop()

deck = Deck()
deck.show()

#6
class Owners(object):
    def __init__(self,name):
        self.name = name
        self.hand = []
    
    def Have_A_Good_Day(self):
        print ( " Have A Good Day!!, {}".format(self.name))
        return self

    def draw(self,Deck,num=1):
        for _ in range(num):
            card = Deck.deal()
            if card:
                self.hand.append(card)
            else:
                return False
        return True

    def showHand(self):
        print("{}'s hand: {} ".format(self.name,self.hand))
        return self

# pp = Owners("Natakorn")
# pp.Have_A_Good_Day()

Deck = Deck()
Deck.shuffle()

pp = Owners("Natakorn")
pp.Have_A_Good_Day()
pp.draw(Deck, 1)
pp.showHand()